app/controllers/admin_controller.rb

SELECT * FROM `usuarios` WHERE ( usu_login = 'hamilton' and usu_senha = 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3' and clinica_id = 2) LIMIT 1
---
  def login
    if request.get?
      session[:usuario_nome] = nil
      session[:usuario_id] = nil
      session[:clinica_id] = nil
      session[:usuario_admin] = nil
      @usuario = Usuario.new
    else
      @usuario = Usuario.new(params[:usuario])
      dados = Usuario.find(:first, :conditions => [" usu_login = ? and usu_senha = ? and clinica_id = ?", @usuario.usu_login, Digest::SHA256.hexdigest(@usuario.usu_senha), @usuario.clinica_id])