app/controllers/consultas_controller.rb

  def index
    @consultas = Consulta.all
    @dentista = Dentista.find(:all,
                              :conditions => ["clinica_id = ?", session[:clinica_id]])
---
SELECT * FROM `consultas`
SELECT * FROM `dentistas` WHERE (clinica_id = 1)