app/controllers/contatos_controller.rb

  def index
    lista = Contato.find(:all,
                         :conditions =>["clinica_id = ?", session[:clinica_id]],
                         :select => "id, ctt_nome, ctt_fone1, ctt_fone2",
                         :order => "ctt_nome") do
      if params[:_search] == "true"
        ctt_nome  =~ "%#{params[:ctt_nome]}%" if params[:ctt_nome].present?
        ctt_fone1 =~ "%#{params[:ctt_fone1]}%" if params[:ctt_fone1].present?
        ctt_fone2 =~ "%#{params[:ctt_fone2]}%" if params[:ctt_fone2].present?
      end
      paginate :page => params[:page], :per_page => params[:rows]
      order_by "#{params[:sidx]} #{params[:sord]}"
    end

    respond_to do |format|
      format.html
      format.json { render :json => lista.to_jqgrid_json([:id, :ctt_nome, :ctt_fone1, :ctt_fone2],
        params[:page], params[:rows], lista.size) }
---
SELECT * FROM `contatos` WHERE (clinica_id = 1) ORDER BY ctt_nome
SELECT * FROM `contatos`

  def show
    @contato = Contato.find(params[:id])
---
SELECT * FROM `contatos` WHERE (`contatos`.`id` = 1)

  def edit
    @contato = Contato.find(params[:id])
---
SELECT * FROM `contatos` WHERE (`contatos`.`id` = 1)

  def create
    @contato = Contato.new(params[:contato])
    @contato.clinica_id = session[:clinica_id]

    respond_to do |format|
      if @contato.save
---
INSERT INTO `contatos` (`ctt_nome`, `ctt_fone1`, `created_at`, `ctt_fone2`, `updated_at`, `clinica_id`, `ctt_obs`) VALUES('Hamilton', '(85) 8767-0386', '2010-12-29 01:56:07', '', '2010-12-29 01:56:07', 1, '')

  def adicionar_favoritos
    @favorito = Meuscontato.new
    @favorito.contato_id = params[:contato_id]
    @favorito.usuario_id = session[:usuario_id]
    @favorito.save
---
INSERT INTO `meuscontatos` (`created_at`, `usuario_id`, `updated_at`, `contato_id`) VALUES('2010-12-29 03:08:25', 1, '2010-12-29 03:08:25', 1)