app/controllers/dentistas_controller.rb

SELECT * FROM `dentistas` WHERE (clinica_id = 'Hamilton Oliveira')
---
  def index
    @dentistas = Dentista.all(:all,
                              :conditions => ["clinica_id = ?", session[:clinica_id]],
                              :order => 'den_nome')

SELECT * FROM `dentistas` WHERE (`dentistas`.`id` = 1)
---
  def show
    @dentista = Dentista.find(params[:id])

SELECT * FROM `dentistas` WHERE (`dentistas`.`id` = 1)
---
  def edit
    @dentista = Dentista.find(params[:id])

INSERT INTO `dentistas` (`den_nome`, `created_at`, `updated_at`, `clinica_id`) VALUES('Valderez Prado', '2010-11-20 15:08:55', '2010-11-20 15:08:55', 0)
---
  def create
    @dentista = Dentista.new(params[:dentista])
    @dentista.clinica_id = session[:clinica_id]

    respond_to do |format|
      if @dentista.save

SELECT * FROM `dentistas` WHERE (`dentistas`.`id` = 1)
UPDATE `dentistas` SET `den_nome` = 'Valderez Prado Oliveira', `updated_at` = '2010-11-20 14:35:43' WHERE `id` = 1
---
  def update
    @dentista = Dentista.find(params[:id])

    respond_to do |format|
      if @dentista.update_attributes(params[:dentista])