app/controllers/fichas_controller.rb

  def index

    if params[:pacienteid] == nil
      params[:pacienteid] = session[:paciente_id]
    else
      session[:paciente_id] = params[:pacienteid]
    end
    @pacienteId = params[:pacienteid]
    @paciente = Paciente.find(@pacienteId)
    @fichas = Ficha.find(:all,
                         :conditions => ["paciente_id = ?", @pacienteId])
---
SELECT * FROM `pacientes` WHERE (`pacientes`.`id` = 1)
SELECT * FROM `fichas` WHERE (paciente_id = NULL)

  def show
    @ficha = Ficha.find(params[:id])
---
SELECT * FROM `fichas` WHERE (`fichas`.`id` = 1)

  def create
    @ficha = Ficha.new(params[:ficha])
    @ficha.paciente_id = session[:paciente_id]
    respond_to do |format|
      if @ficha.save
---
INSERT INTO `fichas` (`created_at`, `paciente_id`, `fic_data`, `updated_at`, `dentista_id`, `fic_desc`) VALUES('2010-12-15 01:16:04', 1, '2010-12-15', '2010-12-15 01:16:04', 1, 'Teste')