app/controllers/horarios_controller.rb

  def index
    @dentistaId = params[:dentistaid]
    if @dentistaId == nil
       @dentistaId = session[:dentistaid]
    end
    @dentista = Dentista.find(@dentistaId)
    session[:dentistaid] = @dentistaId
    @horarios = Horario.find(:all,
                             :conditions => ["dentista_id = ?", @dentistaId])
---
SELECT * FROM `dentistas` WHERE (`dentistas`.`id` = 1)
SELECT * FROM `horarios` WHERE (dentista_id = NULL)

  def show
    @horario = Horario.find(params[:id])
---
SELECT * FROM `horarios` WHERE (`horarios`.`id` = 1)

  def create
    @horario = Horario.new(params[:horario])

    respond_to do |format|
      if @horario.save
---
INSERT INTO `horarios` (`created_at`, `updated_at`, `hor_horafim`, `dentista_id`, `hor_horaini`, `hor_dia`) VALUES('2010-12-18 01:04:47', '2010-12-18 01:04:47', '2010-12-18 01:04:00', 1, '2010-12-18 01:04:00', 1)