app/controllers/odontograma_controller.rb

  def index
    #dentes

    @pacienteId = 1#params[:pacienteid]
    @odontograma = Odontograma.first(:conditions => ["paciente_id = ?", @pacienteId])

    div_dente_cima = "<div id='dente' style='position:absolute; width:25px; height:25px; z-index:7; top: 222px; overflow: visible;' >"
    div_dente_baixo = "<div id='dente' style='position:absolute; width:25px; height:25px; z-index:7; top: 248px; overflow: visible;' >"
    div_dente_baixo2 = "<div id='dente' style='position:absolute; width:25px; height:25px; z-index:7; top: 248px; overflow: visible;' >"
    #div_img_dente_cima ="<div id='dente' style='position:absolute; width:25px; height:70px; top: 197px; overflow: visible;' >"
    div_img_dente_baixo ="<div id='dente' style='position:absolute; width:25px; height:70px; top: 280px; overflow: visible;' >"

    @odontograma_view = "<table><tr>"
    18.downto(11) {
      |n|
      @odontograma_view = @odontograma_view + "<td><img src='../images/dentes/" + n.to_s(10) +".png' width='25' height='70' style='filter: Alpha(Opacity=60);'></td>"
    }

    21.upto(28) {
      |n|
      @odontograma_view = @odontograma_view + "<td><img src='../images/dentes/" + n.to_s(10) +".png' width='25' height='70' style='filter: Alpha(Opacity=60);'></td>"
    }

    @odontograma_view = @odontograma_view + "</tr><tr>"
    18.downto(11) {
      |n|

      acoes = Odontogramadet.find(:all,
                                  :conditions => ["odd_dente = ? and odontograma_id = ?", n, @odontograma.id])
---
SELECT * FROM `odontogramas` WHERE (paciente_id = NULL) LIMIT 1
SELECT * FROM `odontogramadets` WHERE (odd_dente = 18 and odontograma_id = 1)

  def salvar

    @detalhe = Odontogramadet.new
    @detalhe.odd_dente = params[:dente]
    @detalhe.odd_acao  = params[:acao]
    @detalhe.odontograma_id = 1 #params[:idodonto]

    @detalhe.save
---
INSERT INTO `odontogramadets` (`odontograma_id`, `odd_acao`, `created_at`, `odd_dente`, `updated_at`, `odd_data`) VALUES(1, 1, '2010-12-13 02:08:10', 11, '2010-12-13 02:08:10', NULL)