app/controllers/odontogramadet_controller.rb

  def create
    @det = Odontogramadet.new
    @det.odd_dente = params[:dente]
    @det.procedimento_id = params[:acao]
    @det.odontograma_id = session[:odontogramaid]
    @det.odd_data = DateTime.now
    @det.save
---
INSERT INTO `odontogramadets` (`odontograma_id`, `odd_acao`, `created_at`, `odd_dente`, `updated_at`, `odd_data`) VALUES(1, 1, '2010-12-14 02:46:54', 11, '2010-12-14 02:46:54', NULL)