app/controllers/pacientes_controller.rb

  def index
    @nome = params[:nome]
    if @nome == nil
      @nome = ""
    else
      @nome = "%" + params[:nome] + "%"
    end


    @pacientes = Paciente.all(:all,
                              :conditions => ["clinica_id = ? and pac_nome like ?", session[:clinica_id], @nome],
                              :order => 'pac_nome')
---
SELECT * FROM `pacientes` WHERE (clinica_id = 1 and pac_nome like '%%') ORDER BY pac_nome

  def show
    @paciente = Paciente.find(params[:id])
---
SELECT * FROM `pacientes` WHERE (`pacientes`.`id` = 1)

  def edit
    @paciente = Paciente.find(params[:id])
---
SELECT * FROM `pacientes` WHERE (`pacientes`.`id` = 1)

  def create
    @paciente = Paciente.new(params[:paciente])
    @paciente.clinica_id = session[:clinica_id]

    respond_to do |format|
      if @paciente.save
---
INSERT INTO `pacientes` (`created_at`, `pac_fone`, `pac_endereco`, `clinica_id`, `updated_at`, `pac_observacao`, `pac_nome`, `pac_celular`, `pac_bairro`, `pac_cidade`, `pac_uf`) VALUES('2010-12-22 00:51:12', '(85)3491-2158', '', 1, '2010-12-22 00:51:12', '', 'Maria Fernanda', '', '', '', '')

  def update
    @paciente = Paciente.find(params[:id])

    respond_to do |format|
      if @paciente.update_attributes(params[:paciente])
---
SELECT * FROM `pacientes` WHERE (`pacientes`.`id` = 1)
UPDATE `pacientes` SET `updated_at` = '2010-12-22 01:08:43', `pac_endereco` = '', `pac_uf` = '', `pac_bairro` = '', `pac_cidade` = '', `pac_fone` = '(85) 3491-2158', `pac_celular` = '(85) 8767-0386' WHERE `id` = 1