app/controllers/pacientes_controller.rb

  def index
    lista = Paciente.find(:all,
                          :conditions =>["clinica_id = ?", session[:clinica_id]],
                          :select => "id, pac_nome, pac_fone, pac_celular",
                          :order => "pac_nome") do
      if params[:_search] == "true"
        pac_nome  =~ "%#{params[:pac_nome]}%" if params[:pac_nome].present?
        pac_fone =~ "%#{params[:pac_fone]}%" if params[:pac_fone].present?
        pac_celular =~ "%#{params[:pac_celular]}%" if params[:pac_celular].present?
      end
      paginate :page => params[:page], :per_page => params[:rows]
      order_by "#{params[:sidx]} #{params[:sord]}"
    end

    respond_to do |format|
      format.html
      format.json { render :json => lista.to_jqgrid_json([:id, :pac_nome, :pac_fone, :pac_celular],
        params[:page], params[:rows], lista.size) }
---
SELECT * FROM `pacientes` WHERE (clinica_id = 2) LIMIT 0, 30