app/controllers/usuarios_controller.rb

  def create
    valores = params[:usuario]
    @usuario = Usuario.new(params[:usuario])
    @clinica = Clinica.new
    @clinica.cli_nome = valores[:clinica_id]
    @clinica.save
    @usuario.clinica_id = @clinica.id

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `clinicas` (`created_at`, `updated_at`, `cli_nome`) VALUES('2010-11-29 01:23:40', '2010-11-29 01:23:40', 'Santa Isabel')
INSERT INTO `usuarios` (`usu_email`, `usu_admin`, `created_at`, `usu_nome`, `clinica_id`, `updated_at`, `usu_login`, `usu_senha`) VALUES('jhamilton.oliveira@gmail.com', 1, '2010-12-22 01:26:03', 'Maria Valderez', 2, '2010-12-22 01:26:03', 'valderez', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3')